
import request from 'request-promise'

/**
 * BacklogのWikiタイトルを一括変換するスクリプト
 */
const main = async () => {
    try {

        const targetMap = [
            { name: '定例/2019/0823アジェンダ', id: 1074793610 },
            { name: '定例/2019/0830アジェンダ', id: 1074797071 },
            { name: '定例/2019/0906アジェンダ', id: 1074802340 },
            { name: '定例/2019/0913アジェンダ', id: 1074805739 },
            { name: '定例/2019/0920 アジェンダ', id: 1074808577 },
            { name: '定例/2019/0927 アジェンダ', id: 1074811152 },
            { name: '定例/2019/1011 アジェンダ', id: 1074820222 },
            { name: '定例/2019/1018 アジェンダ', id: 1074823579 },
            { name: '定例/2019/1025 アジェンダ', id: 1074825960 },
            { name: '定例/2019/1101 アジェンダ', id: 1074830693 },
            { name: '定例/2019/1108 アジェンダ', id: 1074834382 },
            { name: '定例/2019/1115 アジェンダ', id: 1074838544 },
            { name: '定例/2019/1122 アジェンダ', id: 1074842319 },
            { name: '定例/2019/1129アジェンダ', id: 1074846215 },
            { name: '定例/2019/1205アジェンダ', id: 1074849399 },
            { name: '定例/2019/1213アジェンダ', id: 1074853502 },
            { name: '定例/2019/1220アジェンダ', id: 1074857107 },
            { name: '定例/2020/0110アジェンダ', id: 1074865787 },
            { name: '定例/2020/0131アジェンダ', id: 1074869037 },
            { name: '定例/2020/0214アジェンダ', id: 1074885388 },
            { name: '定例/2020/0221アジェンダ', id: 1074890001 },
            { name: '定例/2020/0228アジェンダ', id: 1074893416 },
            { name: '定例/2020/0306アジェンダ', id: 1074897560 },
            { name: '定例/2020/0313アジェンダ', id: 1074900239 },
            { name: '定例/2020/0327アジェンダ', id: 1074908962 },
            { name: '定例/2020/0501アジェンダ', id: 1074938241 },
            { name: '定例/2020/0515アジェンダ', id: 1074943605 },
            { name: '定例/2020/0522アジェンダ', id: 1074948076 },
            { name: '定例/2020/0529アジェンダ', id: 1074952647 },
            { name: '定例/2020/0605アジェンダ', id: 1074957391 },
            { name: '定例/2020/0612アジェンダ', id: 1074961417 },
            { name: '定例/2020/0619アジェンダ', id: 1074965407 },
            { name: '定例/2020/0626アジェンダ', id: 1074969938 },
            { name: '定例/2020/0703アジェンダ', id: 1074973986 },
            { name: '定例/2020/0710アジェンダ', id: 1074979013 },
            { name: '定例/2020/0717アジェンダ', id: 1074982712 },
            { name: '定例/2020/0731アジェンダ', id: 1074991107 },
            { name: '定例/2020/0807アジェンダ', id: 1074997501 },
            { name: '定例/2020/0814アジェンダ', id: 1075000464 },
            { name: '定例/2020/0821アジェンダ', id: 1075003868 },
            { name: '定例/2020/0828アジェンダ', id: 1075007476 },
            { name: '定例/2020/0904アジェンダ', id: 1075011952 },
            { name: '定例/2020/0911アジェンダ', id: 1075016931 },
            { name: '定例/2020/0911アジェンダ', id: 1075016931 },
        ]
        const PROJECT_KEY = 'FIXME:PROJECTKEY'
        const API_KEY = `FIXME:APIKEY`

        const HOST = `FIXME:BACKLOG HOST`;

        for (const item of targetMap) {
            const wikiUrl = `${HOST}/api/v2/wikis/${item.id}?apiKey=${API_KEY}`
            const wikiData: {
                id: number,
                content: string,
            } = await request.get(wikiUrl, {
                json: true
            });

            const updateRes = await request.patch(wikiUrl, {
                form: {
                    name: item.name,
                    content: wikiData.content,
                    mailNotify: false
                },
                json: true,
            })
            console.log(updateRes);
        }
    } catch (error) {
        console.error(error)
    }
}

main();
